```
Terraform will perform the following actions:

  # aws_cloudwatch_log_group.goldblum_askeeg will be created
  + resource "aws_cloudwatch_log_group" "goldblum_askeeg" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/goldblum-askeeg"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Name"  = "goldblum-askeeg"
          + "Owner" = "zackgold@seas.upenn.edu"
        }
      + tags_all          = {
          + "Name"  = "goldblum-askeeg"
          + "Owner" = "zackgold@seas.upenn.edu"
        }
    }

  # aws_ecs_task_definition.goldblum_askeeg will be created
  + resource "aws_ecs_task_definition" "goldblum_askeeg" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "INPUT_DIR"
                          + value = "/data/input"
                        },
                      + {
                          + name  = "OUTPUT_DIR"
                          + value = "/data/output"
                        },
                      + {
                          + name  = "S3_BUCKET_ARN"
                          + value = "arn:aws:s3:::goldblum-askeeg"
                        },
                      + {
                          + name  = "S3_BUCKET_NAME"
                          + value = "goldblum-askeeg"
                        },
                    ]
                  + essential        = true
                  + image            = "061051226319.dkr.ecr.us-east-1.amazonaws.com/goldblum_askeeg:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/goldblum-askeeg"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + mountPoints      = [
                      + {
                          + containerPath = "/data"
                          + readOnly      = false
                          + sourceVolume  = "data-volume"
                        },
                    ]
                  + name             = "goldblum-askeeg"
                  + portMappings     = [
                      + {
                          + containerPort = 8000
                          + hostPort      = 8000
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "1024"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "goldblum-askeeg"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name"  = "goldblum-askeeg"
          + "Owner" = "zackgold@seas.upenn.edu"
        }
      + tags_all                 = {
          + "Name"  = "goldblum-askeeg"
          + "Owner" = "zackgold@seas.upenn.edu"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false

      + ephemeral_storage {
          + size_in_gib = 25
        }

      + volume {
          + configure_at_launch = (known after apply)
          + name                = "data-volume"
            # (1 unchanged attribute hidden)
        }
    }

  # aws_iam_role.ecs_task_execution_role will be created
  + resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "goldblum_askeeg_ecs_execution_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name"  = "goldblum_askeeg_ecs_execution_role"
          + "Owner" = "zackgold@seas.upenn.edu"
        }
      + tags_all              = {
          + "Name"  = "goldblum_askeeg_ecs_execution_role"
          + "Owner" = "zackgold@seas.upenn.edu"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.ecs_task_role will be created
  + resource "aws_iam_role" "ecs_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "goldblum_askeeg_ecs_task_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name"  = "goldblum_askeeg_ecs_task_role"
          + "Owner" = "zackgold@seas.upenn.edu"
        }
      + tags_all              = {
          + "Name"  = "goldblum_askeeg_ecs_task_role"
          + "Owner" = "zackgold@seas.upenn.edu"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.ecs_task_execution_ec2_policy will be created
  + resource "aws_iam_role_policy" "ecs_task_execution_ec2_policy" {
      + id          = (known after apply)
      + name        = "goldblum_askeeg_ecs_execution_ec2_policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeTags",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:DescribeInstances",
                          + "ec2:AttachNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.ecs_task_s3_policy will be created
  + resource "aws_iam_role_policy" "ecs_task_s3_policy" {
      + id          = (known after apply)
      + name        = "goldblum_askeeg_ecs_task_s3_policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::goldblum-askeeg",
                          + "arn:aws:s3:::goldblum-askeeg/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_task_execution_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "goldblum_askeeg_ecs_execution_role"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloudwatch_log_group    = "/ecs/goldblum-askeeg"
  + ecs_task_definition_arn = (known after apply)
  + s3_bucket_name          = "goldblum-askeeg"
```